backend/controllers/DashboardController.php

SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`id` IN (150, 147, 141, 118, 126, 116, 78, 114, 111, 106, 41, 58, 56, 56, 51, 53, 39, 43, 39, 39, 38, 37, 36, 35, 34, 33, 28, 30, 32, 31, 29, 27, 26, 25, 22, 24, 23, 23, 20, 21, 16, 19, 18, 17, 15, 14, 13, 12, 11, 9, 10, 6, 7, 8, 5, 4, 2, 1)) AND ((`region_id`='SG') AND (`plan_id`='1'))
SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`plan_status`='pending_registration') AND (`region_id`='SG') AND (`plan_id`='1')
SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`plan_status`='pending_approval') AND (`region_id`='SG') AND (`plan_id`='1')
SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`plan_status`='require_clarification') AND (`region_id`='SG') AND (`plan_id`='1')
SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`plan_status`='cancel') AND (`region_id`='SG') AND (`plan_id`='1')
---
    public function actionPlanInfo()
    {
        $plan_id = Yii::$app->request->post('plan_id');
        $data = [];

        $approved_plan_id = UserPlanAction::find()
            ->select(['plan_pool_id', 'created_at'])
            ->andWhere(['action_status' => UserPlanAction::ACTION_APPROVE])
            ->orderBy(['created_at' => SORT_DESC])
            ->distinct()->all();

        $plan_pool_id_arr = array_column($approved_plan_id, 'plan_pool_id');
        //calculate
        $totalApprovedPlan = InstapPlanPool::find()
            ->andWhere(['in','id', $plan_pool_id_arr])
            ->andWhere(['region_id' => Yii::$app->session->get("region_id"), 'plan_id' => $plan_id])
            ->count();

        $totalRegister = InstapPlanPool::find()->andWhere(['plan_status' => InstapPlanPool::STATUS_PENDING_REGISTRATION, 'region_id' => Yii::$app->session->get('region_id'), 'plan_id' => $plan_id])->count();

        $totalPendingApproval = InstapPlanPool::find()->andWhere(['plan_status' => InstapPlanPool::STATUS_PENDING_APPROVAL, 'region_id' => Yii::$app->session->get('region_id'), 'plan_id' => $plan_id])->count();

        $totalClarification = InstapPlanPool::find()->andWhere(['plan_status' => InstapPlanPool::STATUS_REQUIRE_CLARIFICATION, 'region_id' => Yii::$app->session->get('region_id'), 'plan_id' => $plan_id])->count();
        $totalCancelledPlan = InstapPlanPool::find()->andWhere(['plan_status' => InstapPlanPool::STATUS_CANCEL, 'region_id' => Yii::$app->session->get('region_id'), 'plan_id' => $plan_id])->count();

SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`plan_id`='1') AND (NOT (`plan_status`='cancel'))
SELECT COUNT(*) FROM `user_case` LEFT JOIN `instap_plan_pool` ON `user_case`.`plan_pool_id` = `instap_plan_pool`.`id` WHERE ((`instap_plan_pool`.`region_id`='SG') AND (`instap_plan_pool`.`plan_id`='1')) AND (`user_case`.`current_case_status` IN ('claim_pending', 'claim_require_clarification', 'claim_processing', 'claim_repair_in_progress', 'claim_repair_completed', 'claim_closed'))
SELECT COUNT(*) FROM `user_case` LEFT JOIN `instap_plan_pool` ON `user_case`.`plan_pool_id` = `instap_plan_pool`.`id` WHERE (`user_case`.`current_case_status` IN ('claim_processing', 'claim_repair_in_progress', 'claim_repair_completed', 'claim_closed')) AND ((`instap_plan_pool`.`region_id`='SG') AND (`instap_plan_pool`.`plan_id`='1'))
SELECT COUNT(*) FROM `user_case` LEFT JOIN `instap_plan_pool` ON `user_case`.`plan_pool_id` = `instap_plan_pool`.`id` WHERE (`user_case`.`current_case_status`='claim_pending') AND (`instap_plan_pool`.`region_id`='SG') AND (`instap_plan_pool`.`plan_id`='1')
SELECT COUNT(*) FROM `user_case` LEFT JOIN `instap_plan_pool` ON `user_case`.`plan_pool_id` = `instap_plan_pool`.`id` WHERE (`user_case`.`current_case_status`='claim_require_clarification') AND (`instap_plan_pool`.`region_id`='SG') AND (`instap_plan_pool`.`plan_id`='1')
SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`plan_id`='1') AND (`plan_status`='complete_claim')
---
    public function actionClaimInfo()
    {
        $plan_id = Yii::$app->request->post('plan_id');
        // $plan_id = 1;
        // print_r($plan_id);exit();
        $data = [];
        //calculate
        $plan_sold = (float)InstapPlanPool::find()->where(['plan_id'=>$plan_id])->andWhere(['not', ['plan_status'=> InstapPlanPool::STATUS_CANCEL]])->count();

        $totalApprovedClaim = UserCase::find()->joinWith('planPool', true)
            ->andWhere(['instap_plan_pool.region_id' => Yii::$app->session->get('region_id'),  'instap_plan_pool.plan_id' => $plan_id])
            ->andWhere(['in', 'user_case.current_case_status', UserCase::statusNotReject()])
            ->count();

        $totalRegister = UserCase::find()->joinWith('planPool', true)
            ->andWhere(['in', 'user_case.current_case_status', UserCase::statusApproved()])
            ->andWhere(['instap_plan_pool.region_id' => Yii::$app->session->get('region_id'), 'instap_plan_pool.plan_id' => $plan_id])
            ->count();

        $totalPendingApproval = UserCase::find()->joinWith('planPool', true)
            ->andWhere(['user_case.current_case_status' => UserCase::CASE_STATUS_CLAIM_PENDING, 'instap_plan_pool.region_id' => Yii::$app->session->get('region_id'), 'instap_plan_pool.plan_id' => $plan_id])
            ->count();

        $totalClarification = UserCase::find()->joinWith('planPool', true)
            ->andWhere(['user_case.current_case_status' => UserCase::CASE_STATUS_CLAIM_REQUIRE_CLARIFICATION, 'instap_plan_pool.region_id' => Yii::$app->session->get('region_id'), 'instap_plan_pool.plan_id' => $plan_id])
            ->count();

        $claim_ratio = $plan_sold>0?number_format((float)(InstapPlanPool::find()->where(['plan_id'=>$plan_id])->andWhere(['plan_status'=>InstapPlanPool::STATUS_COMPLETE_CLAIM])->count()/$plan_sold), 2, '.', ''):0;

SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`plan_id`='1') AND (NOT (`plan_status`='cancel'))
SELECT COUNT(*) FROM `instap_plan_pool` WHERE ((`region_id`='SG') AND (`plan_id`='1')) AND (`plan_status` NOT IN ('cancel', 'reject'))
---
    public function actionRevenueInfo()
    {
        $data = [];
        $plan_id = Yii::$app->request->post('plan_id');
        $symbol = InstapPlan::currencySymbol()[Yii::$app->session->get('region_id')];
        $plan = InstapPlan::find()->andWhere(['region_id' => Yii::$app->session->get('region_id'), 'id' => $plan_id])->one();

        $plan_sold = InstapPlanPool::find()->where(['plan_id'=>$plan_id])->andWhere(['not', ['plan_status'=> InstapPlanPool::STATUS_CANCEL]])->count();
        $plan_not_reject_or_cancel = InstapPlanPool::find()->andWhere(['region_id' => Yii::$app->session->get('region_id'),  'plan_id' => $plan_id])->andWhere(['not in', 'plan_status', [InstapPlanPool::STATUS_CANCEL, InstapPlanPool::STATUS_REJECT]])->count();