backend/controllers/DealerOrderInventoryOverviewController.php

    public function actionLowInventory($amount)
    {
        $model = DealerOrderInventoryOverview::find()->distinct()->select(["dealer_company_id"])->andWhere(["<=", "quota", $amount])->asArray()->all();
---
SELECT DISTINCT `dealer_company_id` FROM `dealer_order_inventory_overview` WHERE `quota` <= '20'