backend/views/layouts/common.php

                        <a href="<?php echo Url::to(['/dashboard/index']) ?>">
                            <i class="fa fa-bell"></i>
                            <span class="label label-success">
                                <?php echo TimelineEvent::find()->today()->count() ?>
---
SELECT COUNT(*) FROM `timeline_event` WHERE `created_at` >= 1623772800

                        <a href="#" class="dropdown-toggle" data-toggle="dropdown">
                            <img src="<?php echo Yii::$app->user->identity->userProfile->getAvatar() ?>"
                                 class="user-image">
                            <span><?php echo Yii::$app->user->identity->userProfile->first_name ?> <i class="caret"></i></span>
---
SELECT * FROM `user_profile` WHERE `user_id`=5

                        'label' => Yii::t('backend', 'Dashboard'),
                        'icon' => '<i class="fa fa-home"></i>',
                        'url' => ['/dashboard/index'],
                        'badge' => TimelineEvent::find()->today()->count() > 0 ? TimelineEvent::find()->today()->count() : "",
---
SELECT COUNT(*) FROM `timeline_event` WHERE `created_at` >= 1623772800