common/models/DealerCompany.php

SELECT * FROM `dealer_order_inventory_overview` WHERE `dealer_company_id`=63 ORDER BY `plan_id`
---
    public function getInventoryLayout() {
        $invs = $this->inventory;
        // return print_r($invs->attributes);exit();

        $html = "";
        if(!empty($invs)) {
            $html .= '<div class="row container">';
            foreach($invs as $inv) {
                $plan = $inv->getPlan()->asArray()->one();
                $html .= '<a href="'.Url::to(['inventory-detail', 'id'=>$inv->id]).'">';
                $html .= '<div class="column col-lg-4 col-sm-6 inventory-container"><table class="tg"><tbody>';
                $html .= '<tr>';
                    $html .= '<td class="tg-header" rowspan="4"><span class="text-bold">'. $plan['name'] . '</span><br>'. $plan['sku'] .'</div></td>';
                    $html .= '<td class=""><span class="text-success text-bold">Available stock</span></td>';
                    $html .= '<td class=""><div class="inventory-number"><span class="text-success text-bold">' . $inv->quota . '</span></div></td>';
                $html .= '</tr>';
                $html .= '<tr>';
                    $html .= '<td class="">Downline</td>';
                    $html .= '<td class=""><div class="inventory-number">' . DealerOrderInventoryOverview::countDownlineAllocatedStock($inv->dealer_company_id, $inv->plan_id) . '</div></td>';