common/models/InstapPlanPool.php

SELECT COUNT(*) FROM `instap_plan_pool` WHERE (`plan_status`='pending_approval') AND (`region_id`='SG')
---
    public static function countTotalPendingApproval()
    {
        return self::find()->andWhere(['plan_status' => self::STATUS_PENDING_APPROVAL, 'region_id' => Yii::$app->session->get('region_id')])->count();