common/models/SysUserToken.php

    public static function getExisitingToken($user, $type) {
        //$timeNow = time();
        $query = SELF::find();
        $query->where(['user_id'=>$user->id]);
        $query->andWhere(['type'=>$type]);
        //$query->andWhere(['>', 'expire_at', $timeNow]);
        $query->orderBy(['created_at'=>SORT_DESC]);
        return $query->one();
---
SELECT * FROM `sys_user_token` WHERE (`user_id`=5) AND (`type`='one_time_password_cms') ORDER BY `created_at` DESC