common/models/UserCase.php

    public static function countTotalPendingApproval() {
        return self::find()->joinWith('planPool', true)->andWhere(['instap_plan_pool.region_id' => Yii::$app->session->get('region_id'), 'user_case.current_case_status' => self::CASE_STATUS_CLAIM_PENDING])->count();
---
SELECT COUNT(*) FROM `user_case` LEFT JOIN `instap_plan_pool` ON `user_case`.`plan_pool_id` = `instap_plan_pool`.`id` WHERE (`instap_plan_pool`.`region_id`='SG') AND (`user_case`.`current_case_status`='claim_pending')