common/models/User.php

SELECT * FROM `user` WHERE `mobile_number_full`='6598008536'
---
    public static function findByFullMobileNumber($mobile) {
        //return static::find()->active()->andWhere(['mobile_number_full' => $mobile])->one();
        return static::find()->andWhere(['mobile_number_full' => $mobile])->one();