common/models/UserPlanDetailEdit.php

SELECT COUNT(*) FROM `user_plan_detail_edit` LEFT JOIN `instap_plan_pool` ON `user_plan_detail_edit`.`plan_pool_id` = `instap_plan_pool`.`id` WHERE `instap_plan_pool`.`region_id`='SG'
---
    public static function countTotalPendingEditApproval()
    {
        return SELF::find()->joinWith('planPool', true)->andWhere(['instap_plan_pool.region_id' => Yii::$app->session->get('region_id')])->count();