backend/views/instap-plan-pool/index.php

                ],
                'headerOptions' => ['width' => '150px'],
            ],
            [
                'label'=>Yii::t('backend','Purchase From'),
                'format' => 'raw',
                'attribute' => 'company_name',
                //'filter' => '',
                'value' => function($model) {
                    $dealer = DealerCompany::find()->andWhere(["id"=>$model->dealer_company_id])->one();
                    $link = Url::to(['dealer-company/view', 'id' => $model->dealer_company_id]);
                    $html = $dealer->getContactSmallLayout($link);
                    $link = Url::to(['dealer-user/view', 'id' => $model->dealerOrder->dealer_user_id]);
                    $html .= $model->dealerOrder->userProfile->getAvatarSmallLayout($link);
                    return $html;
                },
                'headerOptions' => ['width' => '180px'],
            ],
---
SELECT * FROM `user_profile` WHERE `user_id`=200