common/models/form/DashboardForm.php

    public static function mostSoldPlanByCompany($start_date, $end_date) {
        $html = "";

        $m = InstapPlanPool::find()->select(['dealer_company_id', 'count(dealer_company_id) as c'])->andWhere(['not in', 'plan_status', [InstapPlanPool::STATUS_CANCEL]])->andWhere(['region_id' => Yii::$app->session->get('region_id')])->groupBy(['dealer_company_id'])->andWhere(['between', 'created_at', $start_date, $end_date])->orderBy(['c' => SORT_DESC])->limit(5)->asArray()->all();
---
SELECT `dealer_company_id`, count(dealer_company_id) AS `c` FROM `instap_plan_pool` WHERE (`plan_status`<>'cancel') AND (`region_id`='SG') AND (`created_at` BETWEEN 1577808000 AND 1609430399) GROUP BY `dealer_company_id` ORDER BY `c` DESC LIMIT 5

    public static function mostSoldPlanByStaff($start_date, $end_date) {
        $html = "";
        $plan_pool = InstapPlanPool::find()->select(['id'])->andWhere(['not in', 'plan_status', [InstapPlanPool::STATUS_CANCEL]])->andWhere(['region_id' => Yii::$app->session->get('region_id')])->asArray()->all();
        $plan_pool_arr = array_column($plan_pool, 'id');
        $m = DealerOrder::find()->select(['dealer_user_id', 'count(dealer_user_id) as c'])->andWhere(['in','plan_pool_id', $plan_pool_arr])->andWhere(['between', 'created_at', $start_date, $end_date])->groupBy(['dealer_user_id'])->orderBy(['count(dealer_user_id)' => SORT_DESC])->limit(5)->asArray()->all();

        $html .= "<table class='table'><thead><tr>";
        $html .= "<th width='250'>Retail Assistance</th>";
        $html .= "<th width='*'>Number of policy sold</th>";
        $html .= "</tr></thead>";
        $html .= "<tbody>";

        if(empty($m)) {
            $html .= "<tr><td>No record found.</td></tr>";
        } else {
            foreach ($m as $v) {
                $user = User::find()->where(['id' => $v['dealer_user_id']])->one();
                $name = Html::a($user->userProfile->first_name." ".$user->userProfile->last_name, Url::to(["dealer-user/view", 'id'=>$v['dealer_user_id']]));
---
SELECT `id` FROM `instap_plan_pool` WHERE (`plan_status`<>'cancel') AND (`region_id`='SG')
SELECT * FROM `user` WHERE `id`='5'
SELECT * FROM `user_profile` WHERE `user_id`=5