common/models/form/LoginForm.php

DELETE FROM `sys_user_token` WHERE `id`=1179
---
    public function loginBackend(){
        if ($this->validate()) {
            $user = User::findByFullMobileNumber($this->mobile_number_full);
            // $user = User::findByAdminEmail($this->email_admin);
            if ($user && Yii::$app->authManager->checkAccess($user->id, User::PERMISSION_LOGIN_TO_CMS)) {
                    $validToken = $this->validateToken($user, SysUserToken::TYPE_ONE_TIME_PASSWORD_CMS);
                    if ($validToken && $this->isValidAccount($user)) {
                        $validToken->delete();