common/models/form/OtpForm.php

INSERT INTO `sys_user_token` (`user_id`, `type`, `token`, `expire_at`, `created_at`, `updated_at`) VALUES (5, 'one_time_password_cms', '111111', 1623857282, 1623856982, 1623856982)
---
    public function sendSms($user, $type)
    {
        //$type = SysUserToken::TYPE_ONE_TIME_PASSWORD_API;
        if ($user) {
            $token = SysUserToken::getExisitingToken($user, $type);
            if ($token && $token->getCooldown() > 270 && $token->getCooldown() < 300) { // exist and within 30 seconds
                $this->addError('mobile_number_full', Yii::t('common', 'Please try again in {token} seconds for a new token', ['token' => -(270 - $token->getCooldown())]), CustomHttpException::KEY_WAIT_FOR_COOLDOWN);
                $this->addError('mobile_number', Yii::t('common', 'Please try again in {token} seconds for a new token', ['token' => -(270 - $token->getCooldown())]), CustomHttpException::KEY_WAIT_FOR_COOLDOWN);
                return null;
            }

            SysUserToken::deleteAllUserToken($user, $type);
            $newToken = SysUserToken::makeModel($user, $type);
            if ($newToken->save()) {