backend/views/dashboard/index.php

            echo '<div class="col-md-3 col-sm-6 col-xs-12">';
              echo MyInfoBox::widget([
                'bgColor'=>$bgColor[1],
                'value'=>UserCase::find()->joinWith('planPool', true)->where(['instap_plan_pool.plan_id'=>array_keys($plans)])->andWhere(['current_case_status'=>UserCase::CASE_STATUS_CLAIM_PENDING])->count(),
---
SELECT COUNT(*) FROM `user_case` LEFT JOIN `instap_plan_pool` ON `user_case`.`plan_pool_id` = `instap_plan_pool`.`id` WHERE (`instap_plan_pool`.`plan_id` IN (1, 2, 3, 4, 5)) AND (`current_case_status`='claim_pending')

            echo '<div class="col-md-3 col-sm-6 col-xs-12">';
              echo MyInfoBox::widget([
                'bgColor'=>$bgColor[2],
                'value'=>$query = User::find()->innerJoinWith('userProfile', true)->andWhere(["region_id"=>Yii::$app->session->get('region_id')])->andWhere(["MONTH(STR_TO_DATE(birthday, '%d-%m-%Y'))" => date('m')])->asArray()->count(),
---
SELECT COUNT(*) FROM `user` INNER JOIN `user_profile` ON `user`.`id` = `user_profile`.`user_id` WHERE (`region_id`='SG') AND (MONTH(STR_TO_DATE(birthday, '%d-%m-%Y'))='06')