common/behaviors/LoginTimestampBehavior.php

UPDATE `user` SET `login_at`=1623856984 WHERE `id`=5
INSERT INTO `sys_login_history` (`user_id`, `application`, `login_at`) VALUES (5, 'backend', 1623856984)
---
    public function afterLogin($event)
    {
        $user = $event->identity;
        $user->touch($this->attribute);
        $user->save(false);

        $loginHistory = SysLoginHistory::makeModel();
        $loginHistory->save();